{
  "file_path": "downloads/TD5xxqKyUP4.wav",
  "language": "en",
  "segments": [
    {
      "start": 0.031,
      "end": 4.135,
      "text": "There was also a soldier over 2 meters tall in Joseon."
    },
    {
      "start": 4.356,
      "end": 6.458,
      "text": "Surprisingly, it was recorded in the records."
    },
    {
      "start": 6.478,
      "end": 10.162,
      "text": "In 1792, in the 16th year of Jeongjo, a strange figure appears in Hanyang one day."
    },
    {
      "start": 10.642,
      "end": 12.884,
      "text": "This is what was reported in the military."
    },
    {
      "start": 12.905,
      "end": 15.407,
      "text": "This soldier is 8.5 meters tall."
    },
    {
      "start": 15.427,
      "end": 17.529,
      "text": "As of now, about 2 meters and 20 centimeters."
    },
    {
      "start": 17.549,
      "end": 19.511,
      "text": "At that time, the average height was less than 160 centimeters."
    },
    {
      "start": 19.551,
      "end": 22.014,
      "text": "This man was a monster and a giant himself."
    },
    {
      "start": 22.034,
      "end": 24.957,
      "text": "Jeongjo was surprised and asked directly."
    },
    {
      "start": 24.977,
      "end": 27.94,
      "text": "Is that person a Joseon person?"
    },
    {
      "start": 27.96,
      "end": 29.582,
      "text": "And when I looked at the military service record,"
    },
    {
      "start": 29.562,
      "end": 32.247,
      "text": "He was a peasant from Pyongyang."
    },
    {
      "start": 32.267,
      "end": 36.656,
      "text": "When he was asked to recruit a soldier, he was hired right away without much training."
    },
    {
      "start": 36.696,
      "end": 42.327,
      "text": "His presence has become a hot topic for foreign assassins and even appeared in the records of the Qing Dynasty."
    },
    {
      "start": 42.347,
      "end": 46.055,
      "text": "There are soldiers in Joseon who are twice the height of humans."
    },
    {
      "start": 46.075,
      "end": 51.385,
      "text": "He may not have fought with a sword, but he had a strong impression that would be recorded in the military system of Joseon."
    }
  ],
  "full_text": "There was also a soldier over 2 meters tall in Joseon. Surprisingly, it was recorded in the records. In 1792, in the 16th year of Jeongjo, a strange figure appears in Hanyang one day. This is what was reported in the military. This soldier is 8.5 meters tall. As of now, about 2 meters and 20 centimeters. At that time, the average height was less than 160 centimeters. This man was a monster and a giant himself. Jeongjo was surprised and asked directly. Is that person a Joseon person? And when I looked at the military service record, He was a peasant from Pyongyang. When he was asked to recruit a soldier, he was hired right away without much training. His presence has become a hot topic for foreign assassins and even appeared in the records of the Qing Dynasty. There are soldiers in Joseon who are twice the height of humans. He may not have fought with a sword, but he had a strong impression that would be recorded in the military system of Joseon."
}