{
  "file_path": "downloads/Ay1BJ1fI7WI.wav",
  "language": "en",
  "segments": [
    {
      "start": 0.031,
      "end": 14.885,
      "text": "I wanted to ask you about the modern stock market, specifically the AI boom that's been, for the last three years, arguably the biggest driving force behind earnings growth, behind revenue growth, excitement about stocks."
    },
    {
      "start": 16.367,
      "end": 22.893,
      "text": "What do you think about it when you watch it, or how involved are you with AI stocks with your own money right now?"
    },
    {
      "start": 23.333,
      "end": 27.237,
      "text": "I have zero AI stocks."
    },
    {
      "start": 27.875,
      "end": 31.521,
      "text": "I literally couldn't pronounce NVIDIA until about eight months ago."
    },
    {
      "start": 32.804,
      "end": 35.088,
      "text": "But we had people who felt like they were very tech."
    },
    {
      "start": 36.17,
      "end": 37.432,
      "text": "I am the lowest tech guy ever."
    },
    {
      "start": 37.492,
      "end": 39.896,
      "text": "I mean, my wife is mechanical."
    },
    {
      "start": 39.976,
      "end": 41.159,
      "text": "My daughters are mechanical."
    },
    {
      "start": 42.2,
      "end": 43.663,
      "text": "I can't do anything with computers."
    },
    {
      "start": 43.683,
      "end": 46.508,
      "text": "So I just have yellow pads and a phone."
    },
    {
      "start": 47.872,
      "end": 55.641,
      "text": "From your position as a third party to this, do you think investors have chased these ideas too far?"
    },
    {
      "start": 55.681,
      "end": 61.467,
      "text": "Are there echoes of the 1999, 2000 era to you when you look at it?"
    },
    {
      "start": 61.788,
      "end": 67.734,
      "text": "Or are you open-minded about it, and you say, maybe this is not going to end as badly as that instance did?"
    },
    {
      "start": 69.416,
      "end": 69.957,
      "text": "I have no idea."
    },
    {
      "start": 71.599,
      "end": 71.979,
      "text": "OK."
    },
    {
      "start": 71.999,
      "end": 72.7,
      "text": "I don't have any."
    },
    {
      "start": 72.72,
      "end": 74.402,
      "text": "I have a lot of stocks I like."
    },
    {
      "start": 74.686,
      "end": 75.807,
      "text": "Not in that category."
    },
    {
      "start": 75.927,
      "end": 77.769,
      "text": "So let's talk about your current portfolio."
    },
    {
      "start": 77.789,
      "end": 79.11,
      "text": "What are the stocks that you like today?"
    },
    {
      "start": 79.79,
      "end": 81.352,
      "text": "Fidelity doesn't let me do this anymore."
    },
    {
      "start": 83.053,
      "end": 86.576,
      "text": "In fact, they don't let any employees do that."
    },
    {
      "start": 86.596,
      "end": 88.197,
      "text": "Remember, I was on television."
    },
    {
      "start": 88.217,
      "end": 92.521,
      "text": "I was saying Coca-Cola's a spectacular company."
    },
    {
      "start": 93.462,
      "end": 104.271,
      "text": "But based on what they're doing right now, I think in 10 years, I think the stock will be the same price."
    },
    {
      "start": 104.453,
      "end": 106.035,
      "text": "priced in the next 10 years of growth."
    },
    {
      "start": 106.415,
      "end": 110.16,
      "text": "And we happened to manage Koch's IRA."
    },
    {
      "start": 110.701,
      "end": 111.982,
      "text": "This did not go over big."
    },
    {
      "start": 112.082,
      "end": 114.685,
      "text": "It was not a big success."
    },
    {
      "start": 115.646,
      "end": 125.338,
      "text": "So for good reasons, one of the things that you talked about in your books was the necessity of not chasing glamorous stocks."
    },
    {
      "start": 126.059,
      "end": 131.946,
      "text": "And one of the things you said you liked the best is when a company got itself into trouble,"
    },
    {
      "start": 131.926,
      "end": 136.672,
      "text": "where it was a salvageable situation, but nobody wanted to be caught dead owning it."
    },
    {
      "start": 136.993,
      "end": 141.238,
      "text": "One of the examples that you used famously was waste management, you said."
    },
    {
      "start": 141.779,
      "end": 143.381,
      "text": "Nobody wants anything to do with this stock."
    },
    {
      "start": 143.501,
      "end": 145.304,
      "text": "Number one, they're involved with garbage."
    },
    {
      "start": 145.824,
      "end": 148.328,
      "text": "Number two, everybody thinks the mafia controls it."
    },
    {
      "start": 149.189,
      "end": 150.19,
      "text": "You made a lot of money there."
    },
    {
      "start": 151.232,
      "end": 157.68,
      "text": "Do you think that that heuristic for selecting stocks that are off the beaten path still works for investors?"
    },
    {
      "start": 157.964,
      "end": 164.014,
      "text": "Again, under my thesis that if 10 people look at it, nine will say there's been an expected."
    },
    {
      "start": 165.035,
      "end": 166.698,
      "text": "I don't think people are looking at waste management."
    },
    {
      "start": 167.7,
      "end": 168.621,
      "text": "They just wouldn't look at it."
    },
    {
      "start": 168.681,
      "end": 174.29,
      "text": "Stocks are mispriced when there's a lot of no one in the class of fidelity."
    },
    {
      "start": 174.611,
      "end": 175.653,
      "text": "We have a lot of good competitors."
    },
    {
      "start": 176.193,
      "end": 179.138,
      "text": "And they're doing the same work we're doing."
    },
    {
      "start": 180.08,
      "end": 182.984,
      "text": "And sometimes they're not looking at certain categories of stocks."
    },
    {
      "start": 183.505,
      "end": 184.647,
      "text": "And what I also found out,"
    },
    {
      "start": 186.061,
      "end": 196.831,
      "text": "I've had companies that were losing $6 a share, and things got, they started getting better, the industry hadn't recovered, but they had certain things, and now they're losing $2 a share."
    },
    {
      "start": 197.352,
      "end": 197.552,
      "text": "Right."
    },
    {
      "start": 198.573,
      "end": 200.355,
      "text": "Still not good, but not as bad."
    },
    {
      "start": 200.395,
      "end": 201.876,
      "text": "But I think that's $4 a share improving."
    },
    {
      "start": 203.017,
      "end": 208.423,
      "text": "Then they went from losing two to making two, and the stock quadrupled."
    },
    {
      "start": 208.443,
      "end": 208.823,
      "text": "Yeah."
    },
    {
      "start": 208.843,
      "end": 209.684,
      "text": "It's the same $4."
    },
    {
      "start": 210.525,
      "end": 213.708,
      "text": "What were they doing when they went from losing six to losing two in a bad environment?"
    },
    {
      "start": 213.728,
      "end": 214.449,
      "text": "Things didn't improve."
    },
    {
      "start": 214.829,
      "end": 215.95,
      "text": "They were doing something right."
    },
    {
      "start": 216.723,
      "end": 219.827,
      "text": "Can you tell us about the oxymorons of Wall Street?"
    },
    {
      "start": 220.308,
      "end": 222.311,
      "text": "And some of us are here in the room."
    },
    {
      "start": 222.992,
      "end": 223.953,
      "text": "It was very original."
    },
    {
      "start": 224.013,
      "end": 227.599,
      "text": "You went on this kind of tour de force."
    },
    {
      "start": 228.26,
      "end": 229.301,
      "text": "I don't want to call it a tirade."
    },
    {
      "start": 229.642,
      "end": 239.676,
      "text": "This sort of monologue about, don't be fooled into thinking just because someone's a professional that they can do better than you or they know more than you."
    },
    {
      "start": 240.078,
      "end": 242.105,
      "text": "Warren's got a great quote about this."
    },
    {
      "start": 242.165,
      "end": 250.915,
      "text": "He said, Wall Street is the only place where people take a Rolls Royce to get advice from somebody who took the subway."
    },
    {
      "start": 252.751,
      "end": 256.634,
      "text": "In fairness, I took the subway to my first job on Wall Street for a long time."
    },
    {
      "start": 256.654,
      "end": 264.781,
      "text": "But you talked about the oxymorons, people that thought they knew everything just because they had proximity to the exchange."
    },
    {
      "start": 265.422,
      "end": 272.528,
      "text": "And I think you were giving a pep talk to the reader of the book, telling them, don't think that you can't be good at this too."
    },
    {
      "start": 273.949,
      "end": 274.63,
      "text": "You still believe that?"
    },
    {
      "start": 274.99,
      "end": 275.47,
      "text": "Absolutely."
    },
    {
      "start": 275.49,
      "end": 282.336,
      "text": "I mean, I just think people, average people, feel the fidelity that if they work hard, they're careful."
    },
    {
      "start": 283.193,
      "end": 284.695,
      "text": "And things are not clear."
    },
    {
      "start": 284.755,
      "end": 288.741,
      "text": "I have a term, a poker term, the next card to turn over."
    },
    {
      "start": 290.063,
      "end": 292.246,
      "text": "This next card to turn over, I don't know what it's going to be."
    },
    {
      "start": 293.247,
      "end": 294.009,
      "text": "It could be positive."
    },
    {
      "start": 294.029,
      "end": 294.609,
      "text": "It could be negative."
    },
    {
      "start": 295.05,
      "end": 297.013,
      "text": "But two years from now, this company is going to be better."
    },
    {
      "start": 297.914,
      "end": 301.7,
      "text": "And if the next card turns out to be positive, buy it."
    },
    {
      "start": 301.74,
      "end": 303.202,
      "text": "But I think you should buy some now."
    },
    {
      "start": 303.863,
      "end": 307.788,
      "text": "The next quarter may not be better."
    },
    {
      "start": 307.868,
      "end": 308.59,
      "text": "I mean, we don't know."
    },
    {
      "start": 308.87,
      "end": 311.173,
      "text": "Companies get really tight in these quiet periods."
    },
    {
      "start": 311.614,
      "end": 313.116,
      "text": "So you're doing your best you can."
    },
    {
      "start": 314.092,
      "end": 319.32,
      "text": "But there's three things going to make this company have higher earnings in two to three years."
    },
    {
      "start": 319.801,
      "end": 320.802,
      "text": "We should own it right now."
    },
    {
      "start": 321.723,
      "end": 329.415,
      "text": "OK. And you still think that approach is still the way people should be thinking and not think that somebody knows more than them?"
    },
    {
      "start": 330.877,
      "end": 337.307,
      "text": "Well, I think people tend to concentrate on what's in the new high list."
    },
    {
      "start": 337.868,
      "end": 338.609,
      "text": "Yeah."
    },
    {
      "start": 338.629,
      "end": 340.892,
      "text": "And that's a good place to operate."
    },
    {
      "start": 341.328,
      "end": 343.152,
      "text": "One point BJ's was on the new high list."
    },
    {
      "start": 343.212,
      "end": 349.845,
      "text": "One point Ross Store is on the new high list, or Carvana is on the new high list."
    },
    {
      "start": 350.145,
      "end": 356.097,
      "text": "Companies on the new high list can go up, but I look at the stocks on the new low list."
    },
    {
      "start": 356.137,
      "end": 359.062,
      "text": "Most of them are crap, but some of them are good."
    },
    {
      "start": 359.123,
      "end": 362.088,
      "text": "That style of investing has fallen out of favor in recent years."
    },
    {
      "start": 362.128,
      "end": 363.471,
      "text": "Do you think it'll make a comeback?"
    },
    {
      "start": 364.362,
      "end": 365.363,
      "text": "I hope so."
    },
    {
      "start": 365.484,
      "end": 369.93,
      "text": "Some call it value investing, some call it bottom fishing, whatever the term is."
    },
    {
      "start": 369.95,
      "end": 370.571,
      "text": "Yeah."
    },
    {
      "start": 370.591,
      "end": 372.654,
      "text": "OK, you still think there's something there."
    },
    {
      "start": 373.115,
      "end": 376.26,
      "text": "Well, we get one of the great managers ever, Bruce Johnstone."
    },
    {
      "start": 376.3,
      "end": 377.001,
      "text": "Bruce, you're here somewhere."
    },
    {
      "start": 377.021,
      "end": 377.702,
      "text": "Yeah, Bruce is here."
    },
    {
      "start": 377.942,
      "end": 381.848,
      "text": "Bruce Johnstone's in the audience tonight."
    },
    {
      "start": 384.131,
      "end": 387.897,
      "text": "He's a superstar buying down out companies with a dividend yield."
    },
    {
      "start": 388.358,
      "end": 388.598,
      "text": "Yeah."
    },
    {
      "start": 389.168,
      "end": 392.453,
      "text": "Turn around, he worked incredibly hard, did a lot longer than I did."
    },
    {
      "start": 393.115,
      "end": 396.66,
      "text": "He's a superstar, and he's a great person to boot."
    },
    {
      "start": 396.68,
      "end": 399.425,
      "text": "But he was very thorough, and careful, and prudent."
    },
    {
      "start": 399.445,
      "end": 405.315,
      "text": "And just like me, he was wrong four times out of 10."
    },
    {
      "start": 406.477,
      "end": 409.742,
      "text": "He's saying three, only three."
    },
    {
      "start": 409.908,
      "end": 411.174,
      "text": "Are you impressed?"
    },
    {
      "start": 411.214,
      "end": 417.26,
      "text": "So I understand you're not particularly investing, per se, in the magnificent seven stocks."
    },
    {
      "start": 417.883,
      "end": 420.876,
      "text": "But you've always been an admirer of great businesses."
    },
    {
      "start": 421.84,
      "end": 425.858,
      "text": "I think you'd agree, these are among the greatest public"
    }
  ],
  "full_text": "I wanted to ask you about the modern stock market, specifically the AI boom that's been, for the last three years, arguably the biggest driving force behind earnings growth, behind revenue growth, excitement about stocks. What do you think about it when you watch it, or how involved are you with AI stocks with your own money right now? I have zero AI stocks. I literally couldn't pronounce NVIDIA until about eight months ago. But we had people who felt like they were very tech. I am the lowest tech guy ever. I mean, my wife is mechanical. My daughters are mechanical. I can't do anything with computers. So I just have yellow pads and a phone. From your position as a third party to this, do you think investors have chased these ideas too far? Are there echoes of the 1999, 2000 era to you when you look at it? Or are you open-minded about it, and you say, maybe this is not going to end as badly as that instance did? I have no idea. OK. I don't have any. I have a lot of stocks I like. Not in that category. So let's talk about your current portfolio. What are the stocks that you like today? Fidelity doesn't let me do this anymore. In fact, they don't let any employees do that. Remember, I was on television. I was saying Coca-Cola's a spectacular company. But based on what they're doing right now, I think in 10 years, I think the stock will be the same price. priced in the next 10 years of growth. And we happened to manage Koch's IRA. This did not go over big. It was not a big success. So for good reasons, one of the things that you talked about in your books was the necessity of not chasing glamorous stocks. And one of the things you said you liked the best is when a company got itself into trouble, where it was a salvageable situation, but nobody wanted to be caught dead owning it. One of the examples that you used famously was waste management, you said. Nobody wants anything to do with this stock. Number one, they're involved with garbage. Number two, everybody thinks the mafia controls it. You made a lot of money there. Do you think that that heuristic for selecting stocks that are off the beaten path still works for investors? Again, under my thesis that if 10 people look at it, nine will say there's been an expected. I don't think people are looking at waste management. They just wouldn't look at it. Stocks are mispriced when there's a lot of no one in the class of fidelity. We have a lot of good competitors. And they're doing the same work we're doing. And sometimes they're not looking at certain categories of stocks. And what I also found out, I've had companies that were losing $6 a share, and things got, they started getting better, the industry hadn't recovered, but they had certain things, and now they're losing $2 a share. Right. Still not good, but not as bad. But I think that's $4 a share improving. Then they went from losing two to making two, and the stock quadrupled. Yeah. It's the same $4. What were they doing when they went from losing six to losing two in a bad environment? Things didn't improve. They were doing something right. Can you tell us about the oxymorons of Wall Street? And some of us are here in the room. It was very original. You went on this kind of tour de force. I don't want to call it a tirade. This sort of monologue about, don't be fooled into thinking just because someone's a professional that they can do better than you or they know more than you. Warren's got a great quote about this. He said, Wall Street is the only place where people take a Rolls Royce to get advice from somebody who took the subway. In fairness, I took the subway to my first job on Wall Street for a long time. But you talked about the oxymorons, people that thought they knew everything just because they had proximity to the exchange. And I think you were giving a pep talk to the reader of the book, telling them, don't think that you can't be good at this too. You still believe that? Absolutely. I mean, I just think people, average people, feel the fidelity that if they work hard, they're careful. And things are not clear. I have a term, a poker term, the next card to turn over. This next card to turn over, I don't know what it's going to be. It could be positive. It could be negative. But two years from now, this company is going to be better. And if the next card turns out to be positive, buy it. But I think you should buy some now. The next quarter may not be better. I mean, we don't know. Companies get really tight in these quiet periods. So you're doing your best you can. But there's three things going to make this company have higher earnings in two to three years. We should own it right now. OK. And you still think that approach is still the way people should be thinking and not think that somebody knows more than them? Well, I think people tend to concentrate on what's in the new high list. Yeah. And that's a good place to operate. One point BJ's was on the new high list. One point Ross Store is on the new high list, or Carvana is on the new high list. Companies on the new high list can go up, but I look at the stocks on the new low list. Most of them are crap, but some of them are good. That style of investing has fallen out of favor in recent years. Do you think it'll make a comeback? I hope so. Some call it value investing, some call it bottom fishing, whatever the term is. Yeah. OK, you still think there's something there. Well, we get one of the great managers ever, Bruce Johnstone. Bruce, you're here somewhere. Yeah, Bruce is here. Bruce Johnstone's in the audience tonight. He's a superstar buying down out companies with a dividend yield. Yeah. Turn around, he worked incredibly hard, did a lot longer than I did. He's a superstar, and he's a great person to boot. But he was very thorough, and careful, and prudent. And just like me, he was wrong four times out of 10. He's saying three, only three. Are you impressed? So I understand you're not particularly investing, per se, in the magnificent seven stocks. But you've always been an admirer of great businesses. I think you'd agree, these are among the greatest public"
}